Repository: dev-arrow/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Structural/DependencyInjection/README.po
Languages: es

source: `Dependency Injection`__
es: `Inyección de Dependencias`__

source: Purpose
es: Propósito

source: To implement a loosely coupled architecture in order to get better testable, maintainable and extendable code.
es: Implementar una arquitectura débilmente acoplada para obtener un código más mantenible, extensible y testeable.

source: Usage
es: Uso

source: Configuration gets injected and ``Connection`` will get all that it needs from ``$config``. Without DI, the configuration would be created directly in ``Connection``, which is not very good for testing and extending ``Connection``.
es: ``Configuration`` se inyecta y ``Connection`` obtendrá todo lo que necesita de ``$config``. Sin Inyección de Dependencias, la configuración se crearía directamente en ``Connection``, lo que no es muy óptimo para testear y extender ``Connection``.

source: Notice we are following Inversion of control principle in ``Connection`` by asking ``$config`` to implement ``Parameters`` interface. This decouples our components. We don't care where the source of information comes from, we only care that ``$config`` has certain methods to retrieve that information. Read more about Inversion of control `here <http://en.wikipedia.org/wiki/Inversion_of_control>`__.
es: Observe que estamos siguiendo el principio de inversión de control en` `Conexión`` pidiendo a ``$ config`` que implemente la interfaz de ``Parámetros``. Esto desacopla nuestros componentes. No nos importa de dónde viene la fuente de información, nosotrossolo nos importa que ``$ config`` tenga ciertos métodos para recuperar esa información.Leer más sobre Inversión de control `aquí <https://es.wikipedia.org/wiki/Inversi%C3%B3n_de_control>`__.

source: Examples
es: Ejemplos

source: The Doctrine2 ORM uses dependency injection e.g. for configuration that is injected into a ``Connection`` object. For testing purposes, one can easily create a mock object of the configuration and inject that into the ``Connection`` object
es: Doctrine2 ORM usa inyección de dependencias e.j. para la configuración que se inyecta en un objeto ``Connection``. Para propósitos de testing, uno puede fácilmente crear un objeto simulado de la configuración e inyectarlo en el Objeto ``Conexión``

source: many frameworks already have containers for DI that create objects via a configuration array and inject them where needed (i.e. in Controllers)
es: muchos frameworks ya tienen contenedores para inyección de dependencias que crean objetos a través de una matriz de configuración y los inyecta donde sea necesario (es decir, enControladores)

source: UML Diagram
es: Diagrama UML

source: Code
es: Código

source: You can also find this code on `GitHub`_
es: Puedes encontrar el código en `GitHub`_
